artifacts/server1/K06/K06-F2/mutations/M08-silence-bitmap-open-failure.patch
diff --git a/native/colosseum_server_v1/src/storage/VerificationBitmap.cpp b/native/colosseum_server_v1/src/storage/VerificationBitmap.cpp
--- a/native/colosseum_server_v1/src/storage/VerificationBitmap.cpp
+++ b/native/colosseum_server_v1/src/storage/VerificationBitmap.cpp
@@ -41,13 +41,6 @@ void VerificationBitmap::persist() const
     if (!persistPath_.parent_path().empty())
         std::filesystem::create_directories(persistPath_.parent_path());
     std::ofstream output(persistPath_, std::ios::binary | std::ios::trunc);
-    if (!output.is_open())
-        throw std::runtime_error("verification bitmap open failed: " + persistPath_.string());
     for (const bool bit : bits_)
         output.put(bit ? '\1' : '\0');
-    if (!output)
-        throw std::runtime_error("verification bitmap write failed: " + persistPath_.string());
-    output.flush();
-    if (!output)
-        throw std::runtime_error("verification bitmap flush failed: " + persistPath_.string());
 }
